function initData() {
  jimData.variables["user"] = "";
  jimData.variables["business"] = "";
  jimData.datamasters["user-change"] = [
    {
      "id": 1,
      "datamaster": "user-change",
      "userdata": {
        "序号": "1",
        "用户名": "小明",
        "手机号码": "15927514488",
        "经销商": "蓝色互动",
        "单位名称": "百度",
        "联系电话": "027-5689745",
        "电子邮箱": "126789456@qq.com",
        "微信": "leng",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23"
      }
    },
    {
      "id": 2,
      "datamaster": "user-change",
      "userdata": {
        "序号": "2",
        "用户名": "小红",
        "手机号码": "15927514488",
        "经销商": "蓝色互动",
        "单位名称": "阿里",
        "联系电话": "027-5689745",
        "电子邮箱": "ddd@163.com",
        "微信": "ice",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23"
      }
    },
    {
      "id": 3,
      "datamaster": "user-change",
      "userdata": {
        "序号": "3",
        "用户名": "小华",
        "手机号码": "15927514488",
        "经销商": "蓝色互动",
        "单位名称": "腾讯",
        "联系电话": "027-5689745",
        "电子邮箱": "ddd@163.com",
        "微信": "cold",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23"
      }
    },
    {
      "id": 4,
      "datamaster": "user-change",
      "userdata": {
        "序号": "4",
        "用户名": "小龙",
        "手机号码": "15927514488",
        "经销商": "蓝色互动",
        "单位名称": "百度",
        "联系电话": "027-5689745",
        "电子邮箱": "ddd@163.com",
        "微信": "huafei",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23"
      }
    },
    {
      "id": 5,
      "datamaster": "user-change",
      "userdata": {
        "序号": "5",
        "用户名": "小虎",
        "手机号码": "15927514488",
        "经销商": "蓝色互动",
        "单位名称": "百度",
        "联系电话": "027-5689745",
        "电子邮箱": "llang@qq.com",
        "微信": "xiaoming",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23"
      }
    },
    {
      "id": 6,
      "datamaster": "user-change",
      "userdata": {
        "序号": "6",
        "用户名": "小兰",
        "手机号码": "15927514488",
        "经销商": "蓝色互动",
        "单位名称": "百度",
        "联系电话": "027-5689745",
        "电子邮箱": "ddd@163.com",
        "微信": "yige",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23"
      }
    },
    {
      "id": 7,
      "datamaster": "user-change",
      "userdata": {
        "序号": "7",
        "用户名": "小华",
        "手机号码": "15927514488",
        "经销商": "蓝色互动",
        "单位名称": "百度",
        "联系电话": "027-5689745",
        "电子邮箱": "ddd@163.com",
        "微信": "56qq",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23"
      }
    },
    {
      "id": 8,
      "datamaster": "user-change",
      "userdata": {
        "序号": "8",
        "用户名": "小贝",
        "手机号码": "15927514488",
        "经销商": "蓝色互动",
        "单位名称": "百度",
        "联系电话": "027-5689745",
        "电子邮箱": "ddd@163.com",
        "微信": "youku",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23"
      }
    }
  ];

  jimData.datamasters["user-local"] = [
    {
      "id": 1,
      "datamaster": "user-local",
      "userdata": {
        "序号": "1",
        "收货人": "小明",
        "手机号码": "15927514488",
        "所在地区": "湖北省武汉市洪山区",
        "详细地址": "软件园中路软件园E城E1栋6楼"
      }
    },
    {
      "id": 2,
      "datamaster": "user-local",
      "userdata": {
        "序号": "2",
        "收货人": "小红",
        "手机号码": "15927514488",
        "所在地区": "湖北省武汉市洪山区",
        "详细地址": "软件园中路软件园E城E1栋6楼"
      }
    },
    {
      "id": 3,
      "datamaster": "user-local",
      "userdata": {
        "序号": "3",
        "收货人": "小华",
        "手机号码": "15927514488",
        "所在地区": "湖北省武汉市洪山区",
        "详细地址": "软件园中路软件园E城E1栋6楼"
      }
    },
    {
      "id": 4,
      "datamaster": "user-local",
      "userdata": {
        "序号": "4",
        "收货人": "小龙",
        "手机号码": "15927514488",
        "所在地区": "湖北省武汉市洪山区",
        "详细地址": "软件园中路软件园E城E1栋6楼"
      }
    },
    {
      "id": 5,
      "datamaster": "user-local",
      "userdata": {
        "序号": "5",
        "收货人": "小虎",
        "手机号码": "15927514488",
        "所在地区": "广东省广州市越秀区",
        "详细地址": "软件园中路软件园E城E1栋6楼"
      }
    },
    {
      "id": 6,
      "datamaster": "user-local",
      "userdata": {
        "序号": "6",
        "收货人": "小兰",
        "手机号码": "15927514488",
        "所在地区": "广东省广州市越秀区",
        "详细地址": "软件园中路软件园E城E1栋6楼"
      }
    }
  ];

  jimData.datamasters["user-test-view"] = [
    {
      "id": 1,
      "datamaster": "user-test-view",
      "userdata": {
        "序号": "1",
        "测试参数": "水温",
        "参考范围": "23~30℃",
        "测试结果": "28℃",
        "测试状态": ""
      }
    },
    {
      "id": 2,
      "datamaster": "user-test-view",
      "userdata": {
        "序号": "2",
        "测试参数": "PH",
        "参考范围": "7.2~7.8",
        "测试结果": "8.0",
        "测试状态": ""
      }
    },
    {
      "id": 3,
      "datamaster": "user-test-view",
      "userdata": {
        "序号": "3",
        "测试参数": "自由余氯",
        "参考范围": "0.3~1.0mg/L",
        "测试结果": "0.2mg/L",
        "测试状态": ""
      }
    },
    {
      "id": 4,
      "datamaster": "user-test-view",
      "userdata": {
        "序号": "4",
        "测试参数": "总余氯",
        "参考范围": "<=0.4mg/L",
        "测试结果": "0.8 mg/L",
        "测试状态": ""
      }
    },
    {
      "id": 5,
      "datamaster": "user-test-view",
      "userdata": {
        "序号": "5",
        "测试参数": "总碱度",
        "参考范围": "80~150 mg/L CaCO3",
        "测试结果": "120 mg/L CaCO3",
        "测试状态": ""
      }
    },
    {
      "id": 6,
      "datamaster": "user-test-view",
      "userdata": {
        "序号": "6",
        "测试参数": "钙硬度",
        "参考范围": "100~350 mg/L CaCO3",
        "测试结果": "100 mg/L CaCO3",
        "测试状态": ""
      }
    },
    {
      "id": 7,
      "datamaster": "user-test-view",
      "userdata": {
        "序号": "7",
        "测试参数": "氰尿酸",
        "参考范围": "<=50 mg/L",
        "测试结果": "30 mg/L",
        "测试状态": ""
      }
    },
    {
      "id": 8,
      "datamaster": "user-test-view",
      "userdata": {
        "序号": "8",
        "测试参数": "尿素",
        "参考范围": "<=3.5 mg/L",
        "测试结果": "2.0 mg/L",
        "测试状态": ""
      }
    },
    {
      "id": 9,
      "datamaster": "user-test-view",
      "userdata": {
        "序号": "9",
        "测试参数": "SPAdone无氯杀菌剂",
        "参考范围": "sample text",
        "测试结果": "sample text",
        "测试状态": ""
      }
    }
  ];
  jimData.datamasters["user-test-view"].category = {
    "测试状态": [""]
  };

  jimData.datamasters["code"] = [
    {
      "id": 1,
      "datamaster": "code",
      "userdata": {
        "全选": "true",
        "序号": "1",
        "用户名": "小明",
        "手机号码": "15569891245",
        "邀请码": "YU56W8",
        "添加时间": "2015-08-23  08:20"
      }
    },
    {
      "id": 2,
      "datamaster": "code",
      "userdata": {
        "全选": "true",
        "序号": "2",
        "用户名": "小红",
        "手机号码": "15569891245",
        "邀请码": "YU56W8",
        "添加时间": "2015-08-23  08:20"
      }
    },
    {
      "id": 3,
      "datamaster": "code",
      "userdata": {
        "全选": "true",
        "序号": "3",
        "用户名": "小华",
        "手机号码": "15569891245",
        "邀请码": "YU56W8",
        "添加时间": "2015-08-23  08:20"
      }
    },
    {
      "id": 4,
      "datamaster": "code",
      "userdata": {
        "全选": "true",
        "序号": "4",
        "用户名": "小龙",
        "手机号码": "15569891245",
        "邀请码": "YU56W8",
        "添加时间": "2015-08-23  08:20"
      }
    },
    {
      "id": 5,
      "datamaster": "code",
      "userdata": {
        "全选": "false",
        "序号": "5",
        "用户名": "小虎",
        "手机号码": "15569891245",
        "邀请码": "YU56W8",
        "添加时间": "2015-08-23  08:20"
      }
    },
    {
      "id": 6,
      "datamaster": "code",
      "userdata": {
        "全选": "false",
        "序号": "6",
        "用户名": "小兰",
        "手机号码": "15569891245",
        "邀请码": "YU56W8",
        "添加时间": "2015-08-23  08:20"
      }
    },
    {
      "id": 7,
      "datamaster": "code",
      "userdata": {
        "全选": "false",
        "序号": "7",
        "用户名": "小华",
        "手机号码": "15569891245",
        "邀请码": "YU56W8",
        "添加时间": "2015-08-23  08:20"
      }
    },
    {
      "id": 8,
      "datamaster": "code",
      "userdata": {
        "全选": "false",
        "序号": "8",
        "用户名": "小贝",
        "手机号码": "15569891245",
        "邀请码": "YU56W8",
        "添加时间": "2015-08-23  08:20"
      }
    },
    {
      "id": 9,
      "datamaster": "code",
      "userdata": {
        "全选": "true",
        "序号": "9",
        "用户名": "小贝",
        "手机号码": "15569891245",
        "邀请码": "YU56W8",
        "添加时间": "2015-08-23  08:20"
      }
    }
  ];

  jimData.datamasters["dingdan"] = [
    {
      "id": 1,
      "datamaster": "dingdan",
      "userdata": {
        "序号": "1",
        "用户名": "小明",
        "手机号码": "15568947845",
        "经销商": "蓝色互动",
        "商品详情": "./images/afeddc08-98e6-442e-b235-ae86e32bd59f.jpg",
        "订单状态": "",
        "测试时间": "2015-10-21 08:30",
        "下单时间": "2015-10-22 08:30",
        "处理时间": "2015-10-22 08:35"
      }
    },
    {
      "id": 2,
      "datamaster": "dingdan",
      "userdata": {
        "序号": "2",
        "用户名": "小红",
        "手机号码": "15568947845",
        "经销商": "科匠中国",
        "商品详情": "./images/d6a0789b-eba0-4d95-8749-3254ac7428e5.jpeg",
        "订单状态": "",
        "测试时间": "2015-10-21 08:30",
        "下单时间": "2015-10-22 08:30",
        "处理时间": "2015-10-22 08:35"
      }
    },
    {
      "id": 3,
      "datamaster": "dingdan",
      "userdata": {
        "序号": "3",
        "用户名": "小兰",
        "手机号码": "15568947845",
        "经销商": "北京现代",
        "商品详情": "./images/2995195a-de62-4102-98cb-cfa4616f3325.jpg",
        "订单状态": "",
        "测试时间": "2015-10-21 08:30",
        "下单时间": "2015-10-22 08:30",
        "处理时间": "2015-10-22 08:35"
      }
    },
    {
      "id": 4,
      "datamaster": "dingdan",
      "userdata": {
        "序号": "4",
        "用户名": "小军",
        "手机号码": "15568947845",
        "经销商": "谷歌",
        "商品详情": "./images/d18cec3f-5133-4884-b5bf-0fb521f3f62f.jpg",
        "订单状态": "",
        "测试时间": "2015-10-21 08:30",
        "下单时间": "2015-10-22 08:30",
        "处理时间": "2015-10-22 08:35"
      }
    }
  ];
  jimData.datamasters["dingdan"].category = {
    "订单状态": [""]
  };

  jimData.datamasters["business"] = [
    {
      "id": 1,
      "datamaster": "business",
      "userdata": {
        "全选": "true",
        "序号": "1",
        "用户名": "小明",
        "手机号码": "15927514488",
        "积分": "90",
        "单位名称": "百度",
        "联系电话": "027-5689745",
        "电子邮箱": "126789456@qq.com",
        "微信": "leng",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23",
        "状态": ""
      }
    },
    {
      "id": 2,
      "datamaster": "business",
      "userdata": {
        "全选": "true",
        "序号": "2",
        "用户名": "小红",
        "手机号码": "15927514488",
        "积分": "80",
        "单位名称": "阿里",
        "联系电话": "027-5689745",
        "电子邮箱": "ddd@163.com",
        "微信": "ice",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23",
        "状态": ""
      }
    },
    {
      "id": 3,
      "datamaster": "business",
      "userdata": {
        "全选": "true",
        "序号": "3",
        "用户名": "小华",
        "手机号码": "15927514488",
        "积分": "60",
        "单位名称": "腾讯",
        "联系电话": "027-5689745",
        "电子邮箱": "ddd@163.com",
        "微信": "cold",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23",
        "状态": ""
      }
    },
    {
      "id": 4,
      "datamaster": "business",
      "userdata": {
        "全选": "true",
        "序号": "4",
        "用户名": "小龙",
        "手机号码": "15927514488",
        "积分": "40",
        "单位名称": "百度",
        "联系电话": "027-5689745",
        "电子邮箱": "ddd@163.com",
        "微信": "huafei",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23",
        "状态": ""
      }
    },
    {
      "id": 5,
      "datamaster": "business",
      "userdata": {
        "全选": "false",
        "序号": "5",
        "用户名": "小虎",
        "手机号码": "15927514488",
        "积分": "50",
        "单位名称": "百度",
        "联系电话": "027-5689745",
        "电子邮箱": "llang@qq.com",
        "微信": "xiaoming",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23",
        "状态": ""
      }
    },
    {
      "id": 6,
      "datamaster": "business",
      "userdata": {
        "全选": "false",
        "序号": "6",
        "用户名": "小兰",
        "手机号码": "15927514488",
        "积分": "80",
        "单位名称": "百度",
        "联系电话": "027-5689745",
        "电子邮箱": "ddd@163.com",
        "微信": "yige",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23",
        "状态": ""
      }
    },
    {
      "id": 7,
      "datamaster": "business",
      "userdata": {
        "全选": "false",
        "序号": "7",
        "用户名": "小华",
        "手机号码": "15927514488",
        "积分": "60",
        "单位名称": "百度",
        "联系电话": "027-5689745",
        "电子邮箱": "ddd@163.com",
        "微信": "56qq",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23",
        "状态": ""
      }
    },
    {
      "id": 8,
      "datamaster": "business",
      "userdata": {
        "全选": "false",
        "序号": "8",
        "用户名": "小贝",
        "手机号码": "15927514488",
        "积分": "80",
        "单位名称": "百度",
        "联系电话": "027-5689745",
        "电子邮箱": "ddd@163.com",
        "微信": "youku",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23",
        "状态": ""
      }
    }
  ];
  jimData.datamasters["business"].category = {
    "状态": [""]
  };

  jimData.datamasters["ads"] = [
    {
      "id": 1,
      "datamaster": "ads",
      "userdata": {
        "全选": "false",
        "序号": "1",
        "标题": "小红",
        "发布时间": "2015-01-23  08:23",
        "状态": "",
        "图片": "./images/05182159-9f36-4de5-be9a-0d406fa7d4ff.jpg",
        "链接": "baidu.com",
        "排序": "上移  下移"
      }
    },
    {
      "id": 2,
      "datamaster": "ads",
      "userdata": {
        "全选": "false",
        "序号": "2",
        "标题": "小明",
        "发布时间": "2015-01-23  08:23",
        "状态": "",
        "图片": "./images/e3c9250c-9ecd-4273-9d3f-d730890abff1.jpg",
        "链接": "baidu.com",
        "排序": "上移  下移"
      }
    },
    {
      "id": 3,
      "datamaster": "ads",
      "userdata": {
        "全选": "false",
        "序号": "3",
        "标题": "小红",
        "发布时间": "2015-01-23  08:23",
        "状态": "",
        "图片": "./images/9ba18cf7-eef1-41cf-8d9c-567da1c86bae.jpg",
        "链接": "baidu.com",
        "排序": "上移  下移"
      }
    }
  ];
  jimData.datamasters["ads"].category = {
    "状态": [""]
  };

  jimData.datamasters["question"] = [
    {
      "id": 1,
      "datamaster": "question",
      "userdata": {
        "全选": "false",
        "序号": "1",
        "用户名": "小红",
        "手机号码": "1235689745",
        "反馈内容": "可在机房用加药器投加，也可以往泳池直接投加。使用时请配合万消灵SWIMdone臭氧粉使用，效果更佳。",
        "反馈时间": "2015-01-23  08:23",
        "处理状态": "",
        "处理时间": "2015-01-23  08:23"
      }
    },
    {
      "id": 2,
      "datamaster": "question",
      "userdata": {
        "全选": "false",
        "序号": "2",
        "用户名": "小明",
        "手机号码": "1235689745",
        "反馈内容": "可在机房用加药器投加，也可以往泳池直接投加。使用时请配合万消灵SWIMdone臭氧粉使用，效果更佳。",
        "反馈时间": "2015-01-23  08:23",
        "处理状态": "",
        "处理时间": "2015-01-23  08:23"
      }
    },
    {
      "id": 3,
      "datamaster": "question",
      "userdata": {
        "全选": "false",
        "序号": "3",
        "用户名": "小红",
        "手机号码": "1235689745",
        "反馈内容": "可在机房用加药器投加，也可以往泳池直接投加。使用时请配合万消灵SWIMdone臭氧粉使用，效果更佳。",
        "反馈时间": "2015-01-23  08:23",
        "处理状态": "",
        "处理时间": "2015-01-23  08:23"
      }
    },
    {
      "id": 4,
      "datamaster": "question",
      "userdata": {
        "全选": "false",
        "序号": "4",
        "用户名": "小华",
        "手机号码": "1235689745",
        "反馈内容": "可在机房用加药器投加，也可以往泳池直接投加。使用时请配合万消灵SWIMdone臭氧粉使用，效果更佳。",
        "反馈时间": "2015-01-23  08:23",
        "处理状态": "",
        "处理时间": "2015-01-23  08:23"
      }
    },
    {
      "id": 5,
      "datamaster": "question",
      "userdata": {
        "全选": "false",
        "序号": "5",
        "用户名": "小军",
        "手机号码": "1235689745",
        "反馈内容": "可在机房用加药器投加，也可以往泳池直接投加。使用时请配合万消灵SWIMdone臭氧粉使用，效果更佳。",
        "反馈时间": "2015-01-23  08:23",
        "处理状态": "",
        "处理时间": "2015-01-23  08:23"
      }
    },
    {
      "id": 6,
      "datamaster": "question",
      "userdata": {
        "全选": "false",
        "序号": "6",
        "用户名": "小兰",
        "手机号码": "1235689745",
        "反馈内容": "可在机房用加药器投加，也可以往泳池直接投加。使用时请配合万消灵SWIMdone臭氧粉使用，效果更佳。",
        "反馈时间": "2015-01-23  08:23",
        "处理状态": "",
        "处理时间": "2015-01-23  08:23"
      }
    },
    {
      "id": 7,
      "datamaster": "question",
      "userdata": {
        "全选": "true",
        "序号": "sample text",
        "用户名": "sample text",
        "手机号码": "sample text",
        "反馈内容": "sample text",
        "反馈时间": "sample text",
        "处理状态": "",
        "处理时间": "sample text"
      }
    },
    {
      "id": 8,
      "datamaster": "question",
      "userdata": {
        "全选": "true",
        "序号": "sample text",
        "用户名": "sample text",
        "手机号码": "sample text",
        "反馈内容": "sample text",
        "反馈时间": "sample text",
        "处理状态": "",
        "处理时间": "sample text"
      }
    }
  ];
  jimData.datamasters["question"].category = {
    "处理状态": [""]
  };

  jimData.datamasters["user"] = [
    {
      "id": 1,
      "datamaster": "user",
      "userdata": {
        "全选": "true",
        "序号": "1",
        "用户名": "小明",
        "手机号码": "15927514488",
        "经销商": "蓝色互动",
        "积分": "90",
        "单位名称": "百度",
        "联系电话": "027-5689745",
        "电子邮箱": "126789456@qq.com",
        "微信": "leng",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23",
        "状态": ""
      }
    },
    {
      "id": 2,
      "datamaster": "user",
      "userdata": {
        "全选": "true",
        "序号": "2",
        "用户名": "小红",
        "手机号码": "15927514488",
        "经销商": "蓝色互动",
        "积分": "80",
        "单位名称": "阿里",
        "联系电话": "027-5689745",
        "电子邮箱": "ddd@163.com",
        "微信": "ice",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23",
        "状态": ""
      }
    },
    {
      "id": 3,
      "datamaster": "user",
      "userdata": {
        "全选": "true",
        "序号": "3",
        "用户名": "小华",
        "手机号码": "15927514488",
        "经销商": "蓝色互动",
        "积分": "60",
        "单位名称": "腾讯",
        "联系电话": "027-5689745",
        "电子邮箱": "ddd@163.com",
        "微信": "cold",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23",
        "状态": ""
      }
    },
    {
      "id": 4,
      "datamaster": "user",
      "userdata": {
        "全选": "true",
        "序号": "4",
        "用户名": "小龙",
        "手机号码": "15927514488",
        "经销商": "蓝色互动",
        "积分": "40",
        "单位名称": "百度",
        "联系电话": "027-5689745",
        "电子邮箱": "ddd@163.com",
        "微信": "huafei",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23",
        "状态": ""
      }
    },
    {
      "id": 5,
      "datamaster": "user",
      "userdata": {
        "全选": "false",
        "序号": "5",
        "用户名": "小虎",
        "手机号码": "15927514488",
        "经销商": "蓝色互动",
        "积分": "50",
        "单位名称": "百度",
        "联系电话": "027-5689745",
        "电子邮箱": "llang@qq.com",
        "微信": "xiaoming",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23",
        "状态": ""
      }
    },
    {
      "id": 6,
      "datamaster": "user",
      "userdata": {
        "全选": "false",
        "序号": "6",
        "用户名": "小兰",
        "手机号码": "15927514488",
        "经销商": "蓝色互动",
        "积分": "80",
        "单位名称": "百度",
        "联系电话": "027-5689745",
        "电子邮箱": "ddd@163.com",
        "微信": "yige",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23",
        "状态": ""
      }
    },
    {
      "id": 7,
      "datamaster": "user",
      "userdata": {
        "全选": "false",
        "序号": "7",
        "用户名": "小华",
        "手机号码": "15927514488",
        "经销商": "蓝色互动",
        "积分": "60",
        "单位名称": "百度",
        "联系电话": "027-5689745",
        "电子邮箱": "ddd@163.com",
        "微信": "56qq",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23",
        "状态": ""
      }
    },
    {
      "id": 8,
      "datamaster": "user",
      "userdata": {
        "全选": "false",
        "序号": "8",
        "用户名": "小贝",
        "手机号码": "15927514488",
        "经销商": "蓝色互动",
        "积分": "80",
        "单位名称": "百度",
        "联系电话": "027-5689745",
        "电子邮箱": "ddd@163.com",
        "微信": "youku",
        "QQ": "758694856",
        "注册时间": "2015-10-12  08:23",
        "状态": ""
      }
    }
  ];
  jimData.datamasters["user"].category = {
    "状态": [""]
  };

  jimData.datamasters["help"] = [
    {
      "id": 1,
      "datamaster": "help",
      "userdata": {
        "全选": "false",
        "序号": "1",
        "标题": "小红",
        "内容": "1235689745",
        "发布时间": "2015-01-23  08:23",
        "状态": ""
      }
    },
    {
      "id": 2,
      "datamaster": "help",
      "userdata": {
        "全选": "false",
        "序号": "2",
        "标题": "小明",
        "内容": "1235689745",
        "发布时间": "2015-01-23  08:23",
        "状态": ""
      }
    },
    {
      "id": 3,
      "datamaster": "help",
      "userdata": {
        "全选": "false",
        "序号": "3",
        "标题": "小红",
        "内容": "1235689745",
        "发布时间": "2015-01-23  08:23",
        "状态": ""
      }
    },
    {
      "id": 4,
      "datamaster": "help",
      "userdata": {
        "全选": "false",
        "序号": "4",
        "标题": "小华",
        "内容": "1235689745",
        "发布时间": "2015-01-23  08:23",
        "状态": ""
      }
    },
    {
      "id": 5,
      "datamaster": "help",
      "userdata": {
        "全选": "false",
        "序号": "5",
        "标题": "小军",
        "内容": "1235689745",
        "发布时间": "2015-01-23  08:23",
        "状态": ""
      }
    },
    {
      "id": 6,
      "datamaster": "help",
      "userdata": {
        "全选": "false",
        "序号": "6",
        "标题": "小兰",
        "内容": "1235689745",
        "发布时间": "2015-01-23  08:23",
        "状态": ""
      }
    },
    {
      "id": 7,
      "datamaster": "help",
      "userdata": {
        "全选": "true",
        "序号": "7",
        "标题": "小兵",
        "内容": "1235689745",
        "发布时间": "2015-01-23  08:23",
        "状态": ""
      }
    },
    {
      "id": 8,
      "datamaster": "help",
      "userdata": {
        "全选": "true",
        "序号": "8",
        "标题": "小黑",
        "内容": "1235689745",
        "发布时间": "2015-01-23  08:23",
        "状态": ""
      }
    }
  ];
  jimData.datamasters["help"].category = {
    "状态": [""]
  };

  jimData.datamasters["user-test"] = [
    {
      "id": 1,
      "datamaster": "user-test",
      "userdata": {
        "序号": "1",
        "水体名称": "武汉英东游泳馆",
        "测试时间": "2015-08-21  08:23",
        "订单状态": "",
        "详情": "查看"
      }
    },
    {
      "id": 2,
      "datamaster": "user-test",
      "userdata": {
        "序号": "2",
        "水体名称": "武汉英东游泳馆",
        "测试时间": "2015-08-21  08:23",
        "订单状态": "",
        "详情": "查看"
      }
    },
    {
      "id": 3,
      "datamaster": "user-test",
      "userdata": {
        "序号": "3",
        "水体名称": "武汉英东游泳馆",
        "测试时间": "2015-08-21  08:23",
        "订单状态": "",
        "详情": "查看"
      }
    },
    {
      "id": 4,
      "datamaster": "user-test",
      "userdata": {
        "序号": "4",
        "水体名称": "武汉英东游泳馆",
        "测试时间": "2015-08-21  08:23",
        "订单状态": "",
        "详情": "查看"
      }
    },
    {
      "id": 5,
      "datamaster": "user-test",
      "userdata": {
        "序号": "5",
        "水体名称": "武汉英东游泳馆",
        "测试时间": "2015-08-21  08:23",
        "订单状态": "",
        "详情": "查看"
      }
    },
    {
      "id": 6,
      "datamaster": "user-test",
      "userdata": {
        "序号": "6",
        "水体名称": "武汉英东游泳馆",
        "测试时间": "2015-08-21  08:23",
        "订单状态": "",
        "详情": "查看"
      }
    }
  ];
  jimData.datamasters["user-test"].category = {
    "订单状态": [""]
  };

  jimData.datamasters["user-water"] = [
    {
      "id": 1,
      "datamaster": "user-water",
      "userdata": {
        "序号": "1",
        "水体名称": "小明",
        "所在地区": "湖北省武汉市洪山区",
        "详细地址": "软件园中路软件园E城E1栋6楼",
        "水体类型": "室内泳池",
        "池水来源": "自来水",
        "循环系统": "石英砂过滤器",
        "池水循环周期": "2小时",
        "消毒剂类型": "三氯异氰尿酸",
        "水量": "3000吨",
        "记录时间": "2015-08-21"
      }
    },
    {
      "id": 2,
      "datamaster": "user-water",
      "userdata": {
        "序号": "2",
        "水体名称": "小红",
        "所在地区": "湖北省武汉市洪山区",
        "详细地址": "软件园中路软件园E城E1栋6楼",
        "水体类型": "室内泳池",
        "池水来源": "自来水",
        "循环系统": "石英砂过滤器",
        "池水循环周期": "2小时",
        "消毒剂类型": "三氯异氰尿酸",
        "水量": "3000吨",
        "记录时间": "2015-08-21"
      }
    },
    {
      "id": 3,
      "datamaster": "user-water",
      "userdata": {
        "序号": "3",
        "水体名称": "小华",
        "所在地区": "湖北省武汉市洪山区",
        "详细地址": "软件园中路软件园E城E1栋6楼",
        "水体类型": "室内泳池",
        "池水来源": "自来水",
        "循环系统": "石英砂过滤器",
        "池水循环周期": "2小时",
        "消毒剂类型": "三氯异氰尿酸",
        "水量": "3000吨",
        "记录时间": "2015-08-21"
      }
    },
    {
      "id": 4,
      "datamaster": "user-water",
      "userdata": {
        "序号": "4",
        "水体名称": "小龙",
        "所在地区": "湖北省武汉市洪山区",
        "详细地址": "软件园中路软件园E城E1栋6楼",
        "水体类型": "室内泳池",
        "池水来源": "自来水",
        "循环系统": "石英砂过滤器",
        "池水循环周期": "2小时",
        "消毒剂类型": "三氯异氰尿酸",
        "水量": "3000吨",
        "记录时间": "2015-08-21"
      }
    },
    {
      "id": 5,
      "datamaster": "user-water",
      "userdata": {
        "序号": "5",
        "水体名称": "小虎",
        "所在地区": "广东省广州市越秀区",
        "详细地址": "软件园中路软件园E城E1栋6楼",
        "水体类型": "室内泳池",
        "池水来源": "自来水",
        "循环系统": "石英砂过滤器",
        "池水循环周期": "2小时",
        "消毒剂类型": "三氯异氰尿酸",
        "水量": "3000吨",
        "记录时间": "2015-08-21"
      }
    },
    {
      "id": 6,
      "datamaster": "user-water",
      "userdata": {
        "序号": "6",
        "水体名称": "小兰",
        "所在地区": "广东省广州市越秀区",
        "详细地址": "软件园中路软件园E城E1栋6楼",
        "水体类型": "室内泳池",
        "池水来源": "自来水",
        "循环系统": "石英砂过滤器",
        "池水循环周期": "2小时",
        "消毒剂类型": "三氯异氰尿酸",
        "水量": "3000吨",
        "记录时间": "2015-08-21"
      }
    }
  ];

  jimData.datamasters["news"] = [
    {
      "id": 1,
      "datamaster": "news",
      "userdata": {
        "全选": "false",
        "序号": "1",
        "标题": "小红",
        "发布时间": "2015-01-23  08:23",
        "状态": "",
        "题图": "./images/05182159-9f36-4de5-be9a-0d406fa7d4ff.jpg"
      }
    },
    {
      "id": 2,
      "datamaster": "news",
      "userdata": {
        "全选": "false",
        "序号": "2",
        "标题": "小明",
        "发布时间": "2015-01-23  08:23",
        "状态": "",
        "题图": "./images/e3c9250c-9ecd-4273-9d3f-d730890abff1.jpg"
      }
    },
    {
      "id": 3,
      "datamaster": "news",
      "userdata": {
        "全选": "false",
        "序号": "3",
        "标题": "小红",
        "发布时间": "2015-01-23  08:23",
        "状态": "",
        "题图": "./images/9ba18cf7-eef1-41cf-8d9c-567da1c86bae.jpg"
      }
    }
  ];
  jimData.datamasters["news"].category = {
    "状态": [""]
  };

  jimData.datamasters["product"] = [
    {
      "id": 1,
      "datamaster": "product",
      "userdata": {
        "全选": "true",
        "序号": "1",
        "编号": "K1",
        "名称": "SPAdone无氯杀菌剂",
        "规格": "1L/瓶",
        "售价": "90",
        "描述": "本品能在不影响温泉水、药浴水的水质特性的情况下杀死细菌并抑制细菌增长",
        "图片": "./images/333bee59-7c76-41ef-a7d5-fb2e262f3a07.jpg",
        "添加时间": "2015-08-23  08：30"
      }
    },
    {
      "id": 2,
      "datamaster": "product",
      "userdata": {
        "全选": "true",
        "序号": "2",
        "编号": "K2",
        "名称": "第二代酵素澄清剂",
        "规格": "1L/瓶",
        "售价": "80",
        "描述": "本品是以三氯异氰尿酸为主要有效成分的消毒片，有效氯含量为50％，可杀灭肠道致病菌、化脓性球菌、致病性酵母菌并能灭活病毒。本品为白色或淡黄色片，有异味",
        "图片": "./images/659b03ad-2e32-480c-802f-d47b1795a14b.jpg",
        "添加时间": "2015-08-23  08：30"
      }
    },
    {
      "id": 3,
      "datamaster": "product",
      "userdata": {
        "全选": "true",
        "序号": "3",
        "编号": "K3",
        "名称": "第二代酵素澄清剂",
        "规格": "1L/瓶",
        "售价": "60",
        "描述": "本品是以三氯异氰尿酸为主要有效成分的消毒片，有效氯含量为50％，可杀灭肠道致病菌、化脓性球菌、致病性酵母菌并能灭活病毒。本品为白色或淡黄色片，有异味",
        "图片": "./images/3237eeda-1682-4853-9b27-34877bb90ad9.jpg",
        "添加时间": "2015-08-23  08：30"
      }
    }
  ];

  jimData.datamasters["admin"] = [
    {
      "id": 1,
      "datamaster": "admin",
      "userdata": {
        "全选": "true",
        "序号": "1",
        "用户名": "小明",
        "权限": "",
        "添加时间": "2015-08-23  08:20"
      }
    },
    {
      "id": 2,
      "datamaster": "admin",
      "userdata": {
        "全选": "true",
        "序号": "2",
        "用户名": "小红",
        "权限": "",
        "添加时间": "2015-08-23  08:20"
      }
    },
    {
      "id": 3,
      "datamaster": "admin",
      "userdata": {
        "全选": "true",
        "序号": "3",
        "用户名": "小华",
        "权限": "",
        "添加时间": "2015-08-23  08:20"
      }
    },
    {
      "id": 4,
      "datamaster": "admin",
      "userdata": {
        "全选": "true",
        "序号": "4",
        "用户名": "小龙",
        "权限": "",
        "添加时间": "2015-08-23  08:20"
      }
    },
    {
      "id": 5,
      "datamaster": "admin",
      "userdata": {
        "全选": "false",
        "序号": "5",
        "用户名": "小虎",
        "权限": "",
        "添加时间": "2015-08-23  08:20"
      }
    },
    {
      "id": 6,
      "datamaster": "admin",
      "userdata": {
        "全选": "false",
        "序号": "6",
        "用户名": "小兰",
        "权限": "",
        "添加时间": "2015-08-23  08:20"
      }
    },
    {
      "id": 7,
      "datamaster": "admin",
      "userdata": {
        "全选": "false",
        "序号": "7",
        "用户名": "小华",
        "权限": "",
        "添加时间": "2015-08-23  08:20"
      }
    },
    {
      "id": 8,
      "datamaster": "admin",
      "userdata": {
        "全选": "false",
        "序号": "8",
        "用户名": "小贝",
        "权限": "",
        "添加时间": "2015-08-23  08:20"
      }
    }
  ];
  jimData.datamasters["admin"].category = {
    "权限": [""]
  };

  jimData.datamasters["user-buy"] = [
    {
      "id": 1,
      "datamaster": "user-buy",
      "userdata": {
        "序号": "1",
        "订单编号": "201508241123",
        "订单状态": "",
        "下单时间": "2015-08-21  08:23",
        "经销商": "蓝色互动",
        "订单详情": "查看"
      }
    },
    {
      "id": 2,
      "datamaster": "user-buy",
      "userdata": {
        "序号": "2",
        "订单编号": "201508241123",
        "订单状态": "",
        "下单时间": "2015-08-21  08:23",
        "经销商": "蓝色互动",
        "订单详情": "查看"
      }
    },
    {
      "id": 3,
      "datamaster": "user-buy",
      "userdata": {
        "序号": "3",
        "订单编号": "201508241123",
        "订单状态": "",
        "下单时间": "2015-08-21  08:23",
        "经销商": "蓝色互动",
        "订单详情": "查看"
      }
    },
    {
      "id": 4,
      "datamaster": "user-buy",
      "userdata": {
        "序号": "4",
        "订单编号": "201508241123",
        "订单状态": "",
        "下单时间": "2015-08-21  08:23",
        "经销商": "蓝色互动",
        "订单详情": "查看"
      }
    },
    {
      "id": 5,
      "datamaster": "user-buy",
      "userdata": {
        "序号": "5",
        "订单编号": "201508241123",
        "订单状态": "",
        "下单时间": "2015-08-21  08:23",
        "经销商": "蓝色互动",
        "订单详情": "查看"
      }
    },
    {
      "id": 6,
      "datamaster": "user-buy",
      "userdata": {
        "序号": "6",
        "订单编号": "201508241123",
        "订单状态": "",
        "下单时间": "2015-08-21  08:23",
        "经销商": "蓝色互动",
        "订单详情": "查看"
      }
    }
  ];
  jimData.datamasters["user-buy"].category = {
    "订单状态": [""]
  };

  jimData.datamasters["product-buy"] = [
    {
      "id": 1,
      "datamaster": "product-buy",
      "userdata": {
        "序号": "1",
        "图片": "./images/333bee59-7c76-41ef-a7d5-fb2e262f3a07.jpg",
        "编号": "K1",
        "名称": "SPAdone无氯杀菌剂",
        "描述": "本品能在不影响温泉水、药浴水的水质特性的情况下杀死细菌并抑制细菌增长",
        "规格": "1L/瓶",
        "售价": "90",
        "数量": "2"
      }
    },
    {
      "id": 2,
      "datamaster": "product-buy",
      "userdata": {
        "序号": "2",
        "图片": "./images/659b03ad-2e32-480c-802f-d47b1795a14b.jpg",
        "编号": "K2",
        "名称": "第二代酵素澄清剂",
        "描述": "本品是以三氯异氰尿酸为主要有效成分的消毒片，有效氯含量为50％，可杀灭肠道致病菌、化脓性球菌、致病性酵母菌并能灭活病毒。本品为白色或淡黄色片，有异味",
        "规格": "1L/瓶",
        "售价": "80",
        "数量": "3"
      }
    },
    {
      "id": 3,
      "datamaster": "product-buy",
      "userdata": {
        "序号": "3",
        "图片": "./images/3237eeda-1682-4853-9b27-34877bb90ad9.jpg",
        "编号": "K3",
        "名称": "第二代酵素澄清剂",
        "描述": "本品是以三氯异氰尿酸为主要有效成分的消毒片，有效氯含量为50％，可杀灭肠道致病菌、化脓性球菌、致病性酵母菌并能灭活病毒。本品为白色或淡黄色片，有异味",
        "规格": "1L/瓶",
        "售价": "60",
        "数量": "4"
      }
    }
  ];

  jimData.isInitialized = true;
}